{"basics":{"name":"Adithya Kameswara Rao","email":"akameswa@cs.cmu.edu","phone":"+1 878-834-9321","location":{"city":"Pittsburgh","countryCode":"US","region":"PA"},"profiles":[{"network":"LinkedIn","username":"akameswa","url":"linkedin.com/in/akameswa"},{"network":"GitHub","username":"akameswa","url":"github.com/akameswa"}]},"work":[{"name":"Carnegie Mellon University School of Computer Science","position":"Graduate Research Assistant","startDate":"2023-10-01","endDate":"Present","highlights":["Engineered interactive visualizations showcasing SD internals, running entirely on the browser leveraging WebGPU","Accelerated SD model by 70% through multi-node latent consistency training on 32 V100 GPUs","Creating a web-based tool for LLM finetuning, to be adopted in the AI curriculum for US high schools under AI4GA","Streamlining finetuning by eliminating complex installations, enabling a one-click experience with minimal dependencies"]},{"name":"Apple","position":"Machine Learning Intern","startDate":"2024-05-13","endDate":"2024-08-23","highlights":["Optimized end-to-end MacBook defect detection by improving synthetic data, enhancing unsupervised and supervised ML models. Hosted refined pipeline on internal platform, enabling over ∼ 1000s employees explore model selection.","Boosted synthetic data quality by ∼ 25% utilizing Apple’s MM1 and fostering cross-functional team collaboration.","Doubled anomaly detection recall score via a combined student-teacher and autoencoder-based architecture.","Achieved ∼ 7.5% IoU score improvement with SegFormer (Transformer-based), outperforming Upernet (CNN-based).","Improved object detection mAP@IoU=0.5 by ∼ 6% using YOLOv8x vs. YOLOv5s, with multi-node distb. training."]},{"name":"Hexo","position":"Machine Learning Intern","startDate":"2023-02-13","endDate":"2023-05-22","highlights":["Finetuned a stable diffusion model on several custom product datasets using dreambooth on AWS EC2.","Built robust pipelines for inpainting and outpainting, efficiently generating product backgrounds without distortions.","Improved inference generation through extensive hyperparameter experimentations, ControlNet, and mask modulations.","Devised custom model performance evaluation procedures through FID (~7.5), UIDS, and PIDS metric calculations."]},{"name":"Orangewood Labs","position":"Robotics Engineer","startDate":"2022-05-23","endDate":"2022-12-01","highlights":["Built AR tracking for custom objects using BRIEF feature matching, RANSAC homography, and content warping.","Utilized topological optimization tools to achieve a 40 percent reduction in weight of robotic links.","Manufactured a heat chamber at 1/10th cost of off-the-shelf products for thermal performance testing of robot."]}],"volunteer":[],"education":[{"institution":"Carnegie Mellon University","location":"Pittsburgh, PA","url":"","studyType":"Master of Science","startDate":"2023-08-26","endDate":"2025-05-01","score":"4.0/4.0","courses":["Machine Learning","Deep Learning","Advanced Computer Vision"]}],"awards":[{"title":"K.C. Mahindra Scholarship for Post Graduate Studies Abroad","date":"2023-07-01","awarder":"K.C. Mahindra Education Trust","summary":"K.C. Mahindra Scholarship is an interest-free loan scholarship for pursuing advanced studies overseas. Awarded to top ~3% of the applicants among a pool of 2000+ applicants."},{"title":"Best Paper Award - ICRoM 2022","date":"2022-11-01","awarder":"The RSI International Conference on Robotics and Mechatronics","summary":"Paper titled 'An Abstract Model for Onshore Wind turbine Blade Maintenance' won the 'Best Paper Award' at the '10th RSI International Conference on Robotics and Mechatronics (ICRoM)' among a pool of 1000+ submissions across the world."},{"title":"Working Internships in Science and Engineering (WISE)","date":"2023-05-01","awarder":"DAAD (German Academic Exchange Service)","summary":"The DAAD-WISE Scholarship funds students to carry out a research internship at a publicly-funded higher education institution in Germany. I was one of the 100-odd students from India to be awarded this scholarship."},{"title":"IASc Summer Research Fellowship","date":"2023-04-01","awarder":"National Science Academies (IASc-INSA-NASI)","summary":"Summer Research Fellowship Programme (SRPF) is a prestigious research internship programme supported by the three National Science Academies (IASc-INSA-NASI). I was one of the few students to be selected from a pool of over 30 thousand applicants."}],"publications":[{"name":"An Abstract Model for Onshore Wind turbine Blade Maintenance","publisher":"10th RSI International Conference on Robotics and Mechatronics (ICRoM)","releaseDate":"2022","url":"https://doi.org/10.1109/ICRoM57054.2022.10025349"},{"name":"Conceptual model for improving maneuverability in borewell rescue devices","publisher":"9th RSI International Conference on Robotics and Mechatronics (ICRoM)","releaseDate":"2021","url":"https://doi.org/10.1109/ICRoM54204.2021.9663477"},{"name":"Robotic arm for automatic brake testing and control","publisher":"Journal of Physics: Conference Series","releaseDate":"2021","url":"https://dx.doi.org/10.1088/1742-6596/1831/1/012021"}],"skills":[{"name":"Programming Languages","level":"Advanced","keywords":["Python","C++","Js"]},{"name":"Machine Learning & AI","level":"Advanced","keywords":["PyTorch","Computer Vision","NumPy","Data Analysis"]},{"name":"Cloud & Infrastructure","level":"Advanced","keywords":["AWS","GCP","Linux"]},{"name":"Engineering Tools","level":"Advanced","keywords":["SolidWorks","FEA","CAD"]}],"languages":[],"interests":[],"projects":[{"name":"Tracking and 3D Reconstruction","startDate":"2023-09-01","endDate":"2023-12-01","highlights":["Executed Lucas Kanade tracker with template correction and inverse compositional algorithm, optimizing runtime","Reconstructed 3D point clouds via F matrix computation, stereo triangulation, and bundle adjustment optimization"]},{"name":"Classification and Segmentation of Skin Lesions","startDate":"2022-06-01","endDate":"2022-11-01","highlights":["Evaluated a classification model of ResNet18 architecture with Levit, Swin, Convnext, and EfficientNetV2 families","Attained accuracy of 0.98 and F1 score of 0.85 through construction of an ensemble of multiple architectures","Performed semantic segmentation using transfer learning with pre-trained ImageNet weights for improved performance","Achieved an Intersection over Union (IoU) of 0.95 using the U-Net framework and ResNet34 architecture"]}],"references":[]}